; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 10701 2 2 3 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star2 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(have_image Star6 infrared2)
	(have_image Star7 infrared2)
	(have_image Star8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 star8 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
4. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 5
5. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 5
6. (take_image satellite0 star7 instrument1 infrared2)
   added: (have_image star7 infrared2)
   goals met: 2 of 5
7. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 2 of 5
8. (take_image satellite0 star6 instrument1 infrared2)
   added: (have_image star6 infrared2)
   goals met: 3 of 5
9. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 3 of 5
10. (take_image satellite0 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 4 of 5
11. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 4 of 5
12. (take_image satellite0 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 5 of 5
